; domain
(define (domain depot)
(:requirements :strips :typing)
(:types
    place locatable - object
    depot distributor - place
    truck hoist surface - locatable
    pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action drive
  :parameters (?x - truck ?y - place ?z - place) 
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob6147) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate7)
	(at pallet1 depot1)
	(clear crate12)
	(at pallet2 depot2)
	(clear crate10)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear crate1)
	(at pallet5 distributor2)
	(clear crate13)
	(at pallet6 distributor0)
	(clear crate4)
	(at pallet7 distributor0)
	(clear pallet7)
	(at pallet8 distributor2)
	(clear crate0)
	(at pallet9 distributor0)
	(clear crate14)
	(at truck0 distributor0)
	(at truck1 distributor2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at crate0 distributor2)
	(on crate0 pallet8)
	(at crate1 distributor1)
	(on crate1 pallet4)
	(at crate2 distributor2)
	(on crate2 pallet5)
	(at crate3 depot1)
	(on crate3 pallet1)
	(at crate4 distributor0)
	(on crate4 pallet6)
	(at crate5 distributor2)
	(on crate5 crate2)
	(at crate6 distributor2)
	(on crate6 crate5)
	(at crate7 depot0)
	(on crate7 pallet0)
	(at crate8 depot1)
	(on crate8 crate3)
	(at crate9 depot1)
	(on crate9 crate8)
	(at crate10 depot2)
	(on crate10 pallet2)
	(at crate11 distributor2)
	(on crate11 crate6)
	(at crate12 depot1)
	(on crate12 crate9)
	(at crate13 distributor2)
	(on crate13 crate11)
	(at crate14 distributor0)
	(on crate14 pallet9)
)

(:goal (and
		(on crate0 pallet6)
		(on crate1 pallet4)
		(on crate2 crate11)
		(on crate3 pallet0)
		(on crate4 crate7)
		(on crate5 pallet5)
		(on crate7 pallet8)
		(on crate8 crate3)
		(on crate10 crate14)
		(on crate11 pallet1)
		(on crate12 crate2)
		(on crate13 pallet9)
		(on crate14 pallet3)
	)
))

; plan
1. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 2 of 13
2. (lift hoist5 crate0 pallet8 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist5) (on crate0 pallet8)
   added: (lifting hoist5 crate0) (clear pallet8)
   goals met: 2 of 13
3. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 2 of 13
4. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 2 of 13
5. (lift hoist1 crate12 crate9 depot1)
   deleted: (at crate12 depot1) (clear crate12) (available hoist1) (on crate12 crate9)
   added: (lifting hoist1 crate12) (clear crate9)
   goals met: 2 of 13
6. (load hoist1 crate12 truck1 depot1)
   deleted: (lifting hoist1 crate12)
   added: (in crate12 truck1) (available hoist1)
   goals met: 2 of 13
7. (lift hoist3 crate14 pallet9 distributor0)
   deleted: (at crate14 distributor0) (clear crate14) (available hoist3) (on crate14 pallet9)
   added: (lifting hoist3 crate14) (clear pallet9)
   goals met: 2 of 13
8. (drop hoist3 crate14 pallet3 distributor0)
   deleted: (lifting hoist3 crate14) (clear pallet3)
   added: (available hoist3) (at crate14 distributor0) (clear crate14) (on crate14 pallet3)
   goals met: 3 of 13
9. (lift hoist0 crate7 pallet0 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 pallet0)
   added: (lifting hoist0 crate7) (clear pallet0)
   goals met: 3 of 13
10. (load hoist0 crate7 truck0 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck0) (available hoist0)
   goals met: 3 of 13
11. (drive truck1 depot1 distributor2)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor2)
   goals met: 3 of 13
12. (load hoist5 crate0 truck1 distributor2)
   deleted: (lifting hoist5 crate0)
   added: (in crate0 truck1) (available hoist5)
   goals met: 3 of 13
13. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 3 of 13
14. (lift hoist5 crate13 crate11 distributor2)
   deleted: (at crate13 distributor2) (clear crate13) (available hoist5) (on crate13 crate11)
   added: (lifting hoist5 crate13) (clear crate11)
   goals met: 3 of 13
15. (drive truck1 depot1 distributor2)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor2)
   goals met: 3 of 13
16. (load hoist5 crate13 truck1 distributor2)
   deleted: (lifting hoist5 crate13)
   added: (in crate13 truck1) (available hoist5)
   goals met: 3 of 13
17. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 3 of 13
18. (lift hoist5 crate11 crate6 distributor2)
   deleted: (at crate11 distributor2) (clear crate11) (available hoist5) (on crate11 crate6)
   added: (lifting hoist5 crate11) (clear crate6)
   goals met: 3 of 13
19. (drive truck1 depot1 distributor2)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor2)
   goals met: 3 of 13
20. (load hoist5 crate11 truck1 distributor2)
   deleted: (lifting hoist5 crate11)
   added: (in crate11 truck1) (available hoist5)
   goals met: 3 of 13
21. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 3 of 13
22. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 3 of 13
23. (unload hoist3 crate13 truck1 distributor0)
   deleted: (in crate13 truck1) (available hoist3)
   added: (lifting hoist3 crate13)
   goals met: 3 of 13
24. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   goals met: 3 of 13
25. (drop hoist3 crate13 pallet9 distributor0)
   deleted: (lifting hoist3 crate13) (clear pallet9)
   added: (available hoist3) (at crate13 distributor0) (clear crate13) (on crate13 pallet9)
   goals met: 4 of 13
26. (lift hoist3 crate4 pallet6 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist3) (on crate4 pallet6)
   added: (lifting hoist3 crate4) (clear pallet6)
   goals met: 4 of 13
27. (drop hoist3 crate4 crate14 distributor0)
   deleted: (lifting hoist3 crate4) (clear crate14)
   added: (available hoist3) (at crate4 distributor0) (clear crate4) (on crate4 crate14)
   goals met: 4 of 13
28. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 4 of 13
29. (unload hoist3 crate0 truck1 distributor0)
   deleted: (in crate0 truck1) (available hoist3)
   added: (lifting hoist3 crate0)
   goals met: 4 of 13
30. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   goals met: 4 of 13
31. (drop hoist3 crate0 pallet6 distributor0)
   deleted: (lifting hoist3 crate0) (clear pallet6)
   added: (available hoist3) (at crate0 distributor0) (clear crate0) (on crate0 pallet6)
   goals met: 5 of 13
32. (lift hoist3 crate4 crate14 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist3) (on crate4 crate14)
   added: (lifting hoist3 crate4) (clear crate14)
   goals met: 5 of 13
33. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 5 of 13
34. (unload hoist5 crate7 truck0 distributor2)
   deleted: (in crate7 truck0) (available hoist5)
   added: (lifting hoist5 crate7)
   goals met: 5 of 13
35. (drop hoist5 crate7 pallet8 distributor2)
   deleted: (lifting hoist5 crate7) (clear pallet8)
   added: (available hoist5) (at crate7 distributor2) (clear crate7) (on crate7 pallet8)
   goals met: 6 of 13
36. (lift hoist2 crate10 pallet2 depot2)
   deleted: (at crate10 depot2) (clear crate10) (available hoist2) (on crate10 pallet2)
   added: (lifting hoist2 crate10) (clear pallet2)
   goals met: 6 of 13
37. (drive truck1 depot1 distributor2)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor2)
   goals met: 6 of 13
38. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   goals met: 6 of 13
39. (load hoist2 crate10 truck0 depot2)
   deleted: (lifting hoist2 crate10)
   added: (in crate10 truck0) (available hoist2)
   goals met: 6 of 13
40. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 6 of 13
41. (load hoist3 crate4 truck0 distributor0)
   deleted: (lifting hoist3 crate4)
   added: (in crate4 truck0) (available hoist3)
   goals met: 6 of 13
42. (unload hoist3 crate10 truck0 distributor0)
   deleted: (in crate10 truck0) (available hoist3)
   added: (lifting hoist3 crate10)
   goals met: 6 of 13
43. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   goals met: 6 of 13
44. (unload hoist5 crate4 truck0 distributor2)
   deleted: (in crate4 truck0) (available hoist5)
   added: (lifting hoist5 crate4)
   goals met: 6 of 13
45. (drop hoist3 crate10 crate14 distributor0)
   deleted: (lifting hoist3 crate10) (clear crate14)
   added: (available hoist3) (at crate10 distributor0) (clear crate10) (on crate10 crate14)
   goals met: 7 of 13
46. (drop hoist5 crate4 crate7 distributor2)
   deleted: (lifting hoist5 crate4) (clear crate7)
   added: (available hoist5) (at crate4 distributor2) (clear crate4) (on crate4 crate7)
   goals met: 8 of 13
47. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 8 of 13
48. (lift hoist5 crate6 crate5 distributor2)
   deleted: (at crate6 distributor2) (clear crate6) (available hoist5) (on crate6 crate5)
   added: (lifting hoist5 crate6) (clear crate5)
   goals met: 8 of 13
49. (drop hoist5 crate6 crate4 distributor2)
   deleted: (lifting hoist5 crate6) (clear crate4)
   added: (available hoist5) (at crate6 distributor2) (clear crate6) (on crate6 crate4)
   goals met: 8 of 13
50. (lift hoist5 crate5 crate2 distributor2)
   deleted: (at crate5 distributor2) (clear crate5) (available hoist5) (on crate5 crate2)
   added: (lifting hoist5 crate5) (clear crate2)
   goals met: 8 of 13
51. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 8 of 13
52. (unload hoist1 crate11 truck1 depot1)
   deleted: (in crate11 truck1) (available hoist1)
   added: (lifting hoist1 crate11)
   goals met: 8 of 13
53. (drop hoist1 crate11 crate9 depot1)
   deleted: (lifting hoist1 crate11) (clear crate9)
   added: (available hoist1) (at crate11 depot1) (clear crate11) (on crate11 crate9)
   goals met: 8 of 13
54. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 8 of 13
55. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   goals met: 8 of 13
56. (drop hoist5 crate5 crate6 distributor2)
   deleted: (lifting hoist5 crate5) (clear crate6)
   added: (available hoist5) (at crate5 distributor2) (clear crate5) (on crate5 crate6)
   goals met: 8 of 13
57. (lift hoist5 crate2 pallet5 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist5) (on crate2 pallet5)
   added: (lifting hoist5 crate2) (clear pallet5)
   goals met: 8 of 13
58. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   goals met: 8 of 13
59. (load hoist5 crate2 truck1 distributor2)
   deleted: (lifting hoist5 crate2)
   added: (in crate2 truck1) (available hoist5)
   goals met: 8 of 13
60. (lift hoist5 crate5 crate6 distributor2)
   deleted: (at crate5 distributor2) (clear crate5) (available hoist5) (on crate5 crate6)
   added: (lifting hoist5 crate5) (clear crate6)
   goals met: 8 of 13
61. (drop hoist5 crate5 pallet5 distributor2)
   deleted: (lifting hoist5 crate5) (clear pallet5)
   added: (available hoist5) (at crate5 distributor2) (clear crate5) (on crate5 pallet5)
   goals met: 9 of 13
62. (unload hoist5 crate2 truck1 distributor2)
   deleted: (in crate2 truck1) (available hoist5)
   added: (lifting hoist5 crate2)
   goals met: 9 of 13
63. (drop hoist5 crate2 crate5 distributor2)
   deleted: (lifting hoist5 crate2) (clear crate5)
   added: (available hoist5) (at crate2 distributor2) (clear crate2) (on crate2 crate5)
   goals met: 9 of 13
64. (unload hoist5 crate12 truck1 distributor2)
   deleted: (in crate12 truck1) (available hoist5)
   added: (lifting hoist5 crate12)
   goals met: 9 of 13
65. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 9 of 13
66. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 9 of 13
67. (lift hoist1 crate11 crate9 depot1)
   deleted: (at crate11 depot1) (clear crate11) (available hoist1) (on crate11 crate9)
   added: (lifting hoist1 crate11) (clear crate9)
   goals met: 9 of 13
68. (load hoist1 crate11 truck0 depot1)
   deleted: (lifting hoist1 crate11)
   added: (in crate11 truck0) (available hoist1)
   goals met: 9 of 13
69. (drop hoist5 crate12 crate2 distributor2)
   deleted: (lifting hoist5 crate12) (clear crate2)
   added: (available hoist5) (at crate12 distributor2) (clear crate12) (on crate12 crate2)
   goals met: 10 of 13
70. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   goals met: 10 of 13
71. (unload hoist5 crate11 truck0 distributor2)
   deleted: (in crate11 truck0) (available hoist5)
   added: (lifting hoist5 crate11)
   goals met: 10 of 13
72. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   goals met: 10 of 13
73. (drop hoist5 crate11 crate12 distributor2)
   deleted: (lifting hoist5 crate11) (clear crate12)
   added: (available hoist5) (at crate11 distributor2) (clear crate11) (on crate11 crate12)
   goals met: 10 of 13
74. (lift hoist1 crate9 crate8 depot1)
   deleted: (at crate9 depot1) (clear crate9) (available hoist1) (on crate9 crate8)
   added: (lifting hoist1 crate9) (clear crate8)
   goals met: 10 of 13
75. (load hoist1 crate9 truck0 depot1)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck0) (available hoist1)
   goals met: 10 of 13
76. (lift hoist1 crate8 crate3 depot1)
   deleted: (at crate8 depot1) (clear crate8) (available hoist1) (on crate8 crate3)
   added: (lifting hoist1 crate8) (clear crate3)
   goals met: 9 of 13
77. (load hoist1 crate8 truck0 depot1)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck0) (available hoist1)
   goals met: 9 of 13
78. (lift hoist1 crate3 pallet1 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist1) (on crate3 pallet1)
   added: (lifting hoist1 crate3) (clear pallet1)
   goals met: 9 of 13
79. (load hoist1 crate3 truck0 depot1)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   goals met: 9 of 13
80. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 9 of 13
81. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 9 of 13
82. (unload hoist0 crate3 truck0 depot0)
   deleted: (in crate3 truck0) (available hoist0)
   added: (lifting hoist0 crate3)
   goals met: 9 of 13
83. (drop hoist0 crate3 pallet0 depot0)
   deleted: (lifting hoist0 crate3) (clear pallet0)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 pallet0)
   goals met: 10 of 13
84. (unload hoist0 crate8 truck0 depot0)
   deleted: (in crate8 truck0) (available hoist0)
   added: (lifting hoist0 crate8)
   goals met: 10 of 13
85. (drop hoist0 crate8 crate3 depot0)
   deleted: (lifting hoist0 crate8) (clear crate3)
   added: (available hoist0) (at crate8 depot0) (clear crate8) (on crate8 crate3)
   goals met: 11 of 13
86. (drive truck1 depot1 distributor2)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor2)
   goals met: 11 of 13
87. (lift hoist5 crate11 crate12 distributor2)
   deleted: (at crate11 distributor2) (clear crate11) (available hoist5) (on crate11 crate12)
   added: (lifting hoist5 crate11) (clear crate12)
   goals met: 11 of 13
88. (load hoist5 crate11 truck1 distributor2)
   deleted: (lifting hoist5 crate11)
   added: (in crate11 truck1) (available hoist5)
   goals met: 11 of 13
89. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 11 of 13
90. (unload hoist1 crate11 truck1 depot1)
   deleted: (in crate11 truck1) (available hoist1)
   added: (lifting hoist1 crate11)
   goals met: 11 of 13
91. (drop hoist1 crate11 pallet1 depot1)
   deleted: (lifting hoist1 crate11) (clear pallet1)
   added: (available hoist1) (at crate11 depot1) (clear crate11) (on crate11 pallet1)
   goals met: 12 of 13
92. (drive truck1 depot1 distributor2)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor2)
   goals met: 12 of 13
93. (lift hoist5 crate12 crate2 distributor2)
   deleted: (at crate12 distributor2) (clear crate12) (available hoist5) (on crate12 crate2)
   added: (lifting hoist5 crate12) (clear crate2)
   goals met: 11 of 13
94. (load hoist5 crate12 truck1 distributor2)
   deleted: (lifting hoist5 crate12)
   added: (in crate12 truck1) (available hoist5)
   goals met: 11 of 13
95. (lift hoist5 crate2 crate5 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist5) (on crate2 crate5)
   added: (lifting hoist5 crate2) (clear crate5)
   goals met: 11 of 13
96. (load hoist5 crate2 truck1 distributor2)
   deleted: (lifting hoist5 crate2)
   added: (in crate2 truck1) (available hoist5)
   goals met: 11 of 13
97. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 11 of 13
98. (unload hoist1 crate2 truck1 depot1)
   deleted: (in crate2 truck1) (available hoist1)
   added: (lifting hoist1 crate2)
   goals met: 11 of 13
99. (drop hoist1 crate2 crate11 depot1)
   deleted: (lifting hoist1 crate2) (clear crate11)
   added: (available hoist1) (at crate2 depot1) (clear crate2) (on crate2 crate11)
   goals met: 12 of 13
100. (unload hoist1 crate12 truck1 depot1)
   deleted: (in crate12 truck1) (available hoist1)
   added: (lifting hoist1 crate12)
   goals met: 12 of 13
101. (drop hoist1 crate12 crate2 depot1)
   deleted: (lifting hoist1 crate12) (clear crate2)
   added: (available hoist1) (at crate12 depot1) (clear crate12) (on crate12 crate2)
   goals met: 13 of 13
